//
// Created by matt on 3/20/17.
//



void helping(int flag){
    if(flag == 1){
        printf("rm [-f] [-R] <file1> <file2> <file3>\n"
       "Повинна перепитуватися, чи справді видалити такий-то файл.\n"
        "Опція –f – мовчки видаляти.\n"
        "Опція –R – видаляти директорії" " (без цього ключа повинна відмовитися видаляти директорії!)\n");}
    if(flag == 2){
        printf("mkdir  <dirname> – створити директорію\n"); }
    if(flag == 3){
        printf("mv – перейменування або переміщення файлу\n"
               "mv  [-f] <oldfile> <newfile>\n"
               "mv [-f] <oldfile1> <oldfile2> <oldfile3>.... <newdir>\n"
               "Повинна перепитуватися, чи перезаписувати файл, що вже існує.\n"
               "Опція –f – мовчки перезаписувати.\n"); }
    if(flag == 4){
        printf("cp – копіювати файл з одної директорії в іншу\n"
               "Два варіанти:\n"
               "cp [-h|--help] [-f] <file1> <file2>\n"
               "-- означає копіювати з file1 в file2,\n"
               "cp [-h|--help] [-f]  <file1> <file2> <file3>... <dir>\n"
               "-- всі файли до директорії dir (останнього переданого аргументу).\n"
               "Повинна перепитуватися, чи перезаписувати файл, що вже існує.\n"
               "Опція –f – мовчки перезаписувати.\n");
    }
    if(flag == 5){
        printf("ls [path|mask] [-l] [-h|--help] [--sort=U|S|t|X] [-r] – вивести список файлів\n"
               "Якщо передано шлях – за тим шляхом. Якщо дано маску файлу (*.txt, ab??.dat, xy[klm].sh) – виводити лише файли, що під неї попадають.\n"
               "Перед директоріями слід виводити символ /:\n"
               "/dir1 /dir2 file1.dat file2.dat\n"
               "-l – виводити детальну інформацію про файл: ім’я (включаючи всі розширення), розмір, дату останньої модицікації.\n"
               "--sort – задає критерій сортування: U – не сортувати, S – за розміром, t – за часом останньої модифікації, X – за розширенням, N – за іменем (по замовчуванню).\n"
               "-r – виводити список файлів у зворотному порядку до обраного сортування.\n"
                "------------\n"
        "детальніше про маски:\n"
        "[якісь букви]+ -- будь-який набір з цих букв \n"
        "якісь букви.* -- спочатку ці букви, а замість крапки-зірка що-небудь\n"
        "(якісь букви)+ -- плюс гарантує хоча б одне входження виразу в дужках (або якщо немає дужок то входження останньої букви перед *) \n"
        "якісьбукви? -- знак запитання гарантує одне або нуль потраплянь букви перед ? (не більше) \n"
        "^буква{кількість разів} або  ^буква{від, до}-- ця буква трапиться стільки разів\n");
    }


    return;
}